antaris-inc/SatOS-HAL/drivers/exo_hal_driver_fw/exo_io_al_driver_api/exo_io_al_wrapper/exo_io_al_stm32f7xx/can/src/exo_io_al_stm32f7xx_can.c
/**
 * @file exo_io_al_stm32f7xx_can.c
 *
 * @brief This file contains wrapper function definition for CAN interface
 *
 * @copyright Copyright 2024 Antaris, Inc.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#include "exo_io_al_stm32f7xx_common.h"
#include "exo_io_al_stm32f7xx_can.h"

#ifndef LINUX_TEMP_PORT
#include "stm32f7xx_hal.h"
#endif

/**
 * @brief CAN1 Initialization Function
 *
 * @param[in] ioal_hcan1 : Pointer to ioal can
 */
static void MX_CAN1_Init(ioal_can_hdle *ioal_hcan1);

/**
 * @brief CAN3 Initialization Function
 *
 * @param[in] ioal_hcan3 : Pointer to ioal can
 */
static void MX_CAN3_Init(ioal_can_hdle *ioal_hcan3);

/**
 * @brief CAN2 Initialization Function
 *
 * @param[in] ioal_hcan2 : Pointer to ioal can
 */
static void MX_CAN2_Init(ioal_can_hdle *ioal_hcan2);

/**
 * @brief  Transmission Mailbox 0 complete callback function
 * @param[in]  hcan - hcan pointer to a CAN_HandleTypeDef structure that contains
 *         the configuration information for the specified CAN.
 * @retval None
 */
void io_hal_stm32f7xx_can_tx_mb0_cplt_cb(CAN_HandleTypeDef *hcan);
/**
 * @brief  Transmission Mailbox 1 complete callback function
 * @param[in]  hcan - hcan pointer to a CAN_HandleTypeDef structure that contains
 *         the configuration information for the specified CAN.
 * @retval None
 */
void io_hal_stm32f7xx_can_tx_mb1_cplt_cb(CAN_HandleTypeDef *hcan);
/**
 * @brief  Transmission Mailbox 2 complete callback function
 * @param[in]  hcan - hcan pointer to a CAN_HandleTypeDef structure that contains
 *         the configuration information for the specified CAN.
 * @retval None
 */
void io_hal_stm32f7xx_can_tx_mb2_cplt_cb(CAN_HandleTypeDef *hcan);
/**
 * @brief  Transmission Mailbox 0 Cancellation callback function
 * @param[in]  hcan - hcan pointer to a CAN_HandleTypeDef structure that contains
 *         the configuration information for the specified CAN.
 * @retval None
 */
void io_hal_stm32f7xx_can_mb0_abort_cb(CAN_HandleTypeDef *hcan);
/**
 * @brief  Transmission Mailbox 1 Cancellation callback function
 * @param[in]  hcan - hcan pointer to a CAN_HandleTypeDef structure that contains
 *         the configuration information for the specified CAN.
 * @retval None
 */
void io_hal_stm32f7xx_can_mb1_abort_cb(CAN_HandleTypeDef *hcan);
/**
 * @brief  Transmission Mailbox 2 Cancellation callback function
 * @param[in]  hcan - hcan pointer to a CAN_HandleTypeDef structure that contains
 *         the configuration information for the specified CAN.
 * @retval None
 */
void io_hal_stm32f7xx_can_mb2_abort_cb(CAN_HandleTypeDef *hcan);
/**
 * @brief  Rx FIFO 0 message pending callback function
 * @param[in]  hcan - hcan pointer to a CAN_HandleTypeDef structure that contains
 *         the configuration information for the specified CAN.
 * @retval None
 */
void io_hal_stm32f7xx_can_fifo0_msg_pend_cb(CAN_HandleTypeDef *hcan);
/**
 * @brief  Rx FIFO 0 full callback function
 * @param[in]  hcan - hcan pointer to a CAN_HandleTypeDef structure that contains
 *         the configuration information for the specified CAN.
 * @retval None
 */
void io_hal_stm32f7xx_can_fifo0_full_cb(CAN_HandleTypeDef *hcan);
/**
 * @brief  Rx FIFO 1 message pending callback function
 * @param[in]  hcan - hcan pointer to a CAN_HandleTypeDef structure that contains
 *         the configuration information for the specified CAN.
 * @retval None
 */
void io_hal_stm32f7xx_can_fifo1_msg_pend_cb(CAN_HandleTypeDef *hcan);
/**
 * @brief  Rx FIFO 1 full callback function
 * @param[in]  hcan - hcan pointer to a CAN_HandleTypeDef structure that contains
 *         the configuration information for the specified CAN.
 * @retval None
 */
void io_hal_stm32f7xx_can_fifo1_full_cb(CAN_HandleTypeDef *hcan);
/**
 * @brief  Sleep callback function
 * @param[in]  hcan - hcan pointer to a CAN_HandleTypeDef structure that contains
 *         the configuration information for the specified CAN.
 * @retval None
 */
void io_hal_stm32f7xx_can_sleep_cb(CAN_HandleTypeDef *hcan);
/**
 * @brief  WakeUp from Rx message callback function
 * @param[in]  hcan - hcan pointer to a CAN_HandleTypeDef structure that contains
 *         the configuration information for the specified CAN.
 * @retval None
 */
void io_hal_stm32f7xx_can_wakeup_cb(CAN_HandleTypeDef *hcan);
/**
 * @brief  Error CAN callback function
 * @param[in]  hcan - hcan pointer to a CAN_HandleTypeDef structure that contains
 *         the configuration information for the specified CAN.
 * @retval None
 */
void io_hal_stm32f7xx_can_error_cb(CAN_HandleTypeDef *hcan);


CAN_HandleTypeDef hcan1;
CAN_FilterTypeDef can1_filterconfig;

CAN_HandleTypeDef hcan3;
CAN_FilterTypeDef can3_filterconfig;

CAN_HandleTypeDef hcan2;
CAN_FilterTypeDef can2_filterconfig;


/**
 * @brief  This function initializes the CAN1 peripheral according to the specified
 *         parameters
 */
hal_ret_sts io_hal_stm32f7xx_can1_init(ioal_can_hdle *ioal_hcan1)
{
    MX_CAN1_Init(ioal_hcan1);
    return 0;
}

/**
 * @brief  This function initializes the CAN3 peripheral according to the specified
 *         parameters
 */
hal_ret_sts io_hal_stm32f7xx_can3_init(ioal_can_hdle *ioal_hcan3)
{
    MX_CAN3_Init(ioal_hcan3);
    return 0;
}

/**
 * @brief  This function initializes the CAN2 peripheral according to the specified
 *         parameters
 */
hal_ret_sts io_hal_stm32f7xx_can2_init(ioal_can_hdle *ioal_hcan2)
{
    MX_CAN2_Init(ioal_hcan2);
    return 0;
}

/**
 * @brief CAN1 Initialization Function
 */
static void MX_CAN1_Init(ioal_can_hdle *ioal_hcan1)
{

    hcan1.Instance = CAN1;
    hcan1.Init.Prescaler = 10;
    hcan1.Init.Mode = CAN_MODE_NORMAL;
    hcan1.Init.SyncJumpWidth = CAN_SJW_1TQ;
    hcan1.Init.TimeSeg1 = CAN_BS1_2TQ;
    hcan1.Init.TimeSeg2 = CAN_BS2_2TQ;
    hcan1.Init.TimeTriggeredMode = DISABLE;
    hcan1.Init.AutoBusOff = DISABLE;
    hcan1.Init.AutoWakeUp = DISABLE;
    hcan1.Init.AutoRetransmission = DISABLE;
    hcan1.Init.ReceiveFifoLocked = DISABLE;
    hcan1.Init.TransmitFifoPriority = DISABLE;
    if (HAL_CAN_Init(&hcan1) != HAL_OK)
    {
        ioal_error_handler();
    }

    can1_filterconfig.FilterActivation = CAN_FILTER_ENABLE;
    can1_filterconfig.FilterBank = 10;
    can1_filterconfig.FilterFIFOAssignment = CAN_RX_FIFO0;
    can1_filterconfig.FilterIdHigh = 0;
    can1_filterconfig.FilterIdLow = 0;
    can1_filterconfig.FilterMaskIdHigh = 0;
    can1_filterconfig.FilterMaskIdLow = 0;
    can1_filterconfig.FilterMode = CAN_FILTERMODE_IDMASK;
    can1_filterconfig.FilterScale = CAN_FILTERSCALE_32BIT;
    can1_filterconfig.SlaveStartFilterBank = 13;
    HAL_CAN_ConfigFilter(&hcan1, &can1_filterconfig);

    ioal_hcan1->intf_gen_info.vdp_intf_inst_hdle = (void*)&hcan1;
    ioal_hcan1->intf_gen_info.state = IO_FREE_STATE;
}

/**
 * @brief CAN3 Initialization Function
 */
static void MX_CAN3_Init(ioal_can_hdle *ioal_hcan3)
{
    hcan3.Instance = CAN3;
    hcan3.Init.Prescaler = 10;
    hcan3.Init.Mode = CAN_MODE_NORMAL;
    hcan3.Init.SyncJumpWidth = CAN_SJW_1TQ;
    hcan3.Init.TimeSeg1 = CAN_BS1_2TQ;
    hcan3.Init.TimeSeg2 = CAN_BS2_2TQ;
    hcan3.Init.TimeTriggeredMode = DISABLE;
    hcan3.Init.AutoBusOff = DISABLE;
    hcan3.Init.AutoWakeUp = DISABLE;
    hcan3.Init.AutoRetransmission = DISABLE;
    hcan3.Init.ReceiveFifoLocked = DISABLE;
    hcan3.Init.TransmitFifoPriority = DISABLE;
    if (HAL_CAN_Init(&hcan3) != HAL_OK)
    {
        ioal_error_handler();
    }
    can3_filterconfig.FilterActivation = CAN_FILTER_ENABLE;
    can3_filterconfig.FilterBank = 10;
    can3_filterconfig.FilterFIFOAssignment = CAN_RX_FIFO0;
    can3_filterconfig.FilterIdHigh = 0;
    can3_filterconfig.FilterIdLow = 0;
    can3_filterconfig.FilterMaskIdHigh = 0;
    can3_filterconfig.FilterMaskIdLow = 0;
    can3_filterconfig.FilterMode = CAN_FILTERMODE_IDMASK;
    can3_filterconfig.FilterScale = CAN_FILTERSCALE_32BIT;
    can3_filterconfig.SlaveStartFilterBank = 13;
    HAL_CAN_ConfigFilter(&hcan3, &can3_filterconfig);
    ioal_hcan3->intf_gen_info.vdp_intf_inst_hdle = (void*)&hcan3;
    ioal_hcan3->intf_gen_info.state = IO_FREE_STATE;

