antaris-inc/SatOS-HAL/drivers/exo_hal_driver_fw/exo_io_al_driver_api/exo_io_al_wrapper/exo_io_al_stm32f7xx/can/src/exo_io_al_stm32f7xx_can.c
}

/**
 * @brief CAN2 Initialization Function
 */
static void MX_CAN2_Init(ioal_can_hdle *ioal_hcan2)
{
    hcan2.Instance = CAN2;
    hcan2.Init.Prescaler = 10;
    hcan2.Init.Mode = CAN_MODE_NORMAL;
    hcan2.Init.SyncJumpWidth = CAN_SJW_1TQ;
    hcan2.Init.TimeSeg1 = CAN_BS1_2TQ;
    hcan2.Init.TimeSeg2 = CAN_BS2_2TQ;
    hcan2.Init.TimeTriggeredMode = DISABLE;
    hcan2.Init.AutoBusOff = DISABLE;
    hcan2.Init.AutoWakeUp = DISABLE;
    hcan2.Init.AutoRetransmission = DISABLE;
    hcan2.Init.ReceiveFifoLocked = DISABLE;
    hcan2.Init.TransmitFifoPriority = DISABLE;
    if (HAL_CAN_Init(&hcan2) != HAL_OK)
    {
        ioal_error_handler();
    }
    can2_filterconfig.FilterActivation = CAN_FILTER_ENABLE;
    can2_filterconfig.FilterBank = 10;
    can2_filterconfig.FilterFIFOAssignment = CAN_RX_FIFO0;
    can2_filterconfig.FilterIdHigh = 0;
    can2_filterconfig.FilterIdLow = 0;
    can2_filterconfig.FilterMaskIdHigh = 0;
    can2_filterconfig.FilterMaskIdLow = 0;
    can2_filterconfig.FilterMode = CAN_FILTERMODE_IDMASK;
    can2_filterconfig.FilterScale = CAN_FILTERSCALE_32BIT;
    can2_filterconfig.SlaveStartFilterBank = 0;
    HAL_CAN_ConfigFilter(&hcan2, &can2_filterconfig);
    ioal_hcan2->intf_gen_info.vdp_intf_inst_hdle = (void*)&hcan2;
    ioal_hcan2->intf_gen_info.state = IO_FREE_STATE;

}

/**
 * @brief This function starts the CAN interface.
 */
hal_ret_sts io_hal_stm32f7xx_can_start(ioal_can_hdle *ioal_hcan)
{
    hal_ret_sts ret_sts = HAL_MAX_ERR;
    CAN_HandleTypeDef *hcan = ioal_hcan->intf_gen_info.vdp_intf_inst_hdle;
    if(HAL_OK == HAL_CAN_Start(hcan))
    {
        ret_sts = HAL_SCS;
    }
    else
    {
        ret_sts = HAL_IO_VDP_ERR;
    }
    return ret_sts;
}

/**
 * @brief  This function stops the CAN interface
 */
hal_ret_sts io_hal_stm32f7xx_can_stop(ioal_can_hdle *ioal_hcan)
{
    hal_ret_sts ret_sts = HAL_MAX_ERR;
    CAN_HandleTypeDef *hcan = ioal_hcan->intf_gen_info.vdp_intf_inst_hdle;
    if(HAL_OK == HAL_CAN_Stop(hcan))
    {
        ret_sts = HAL_SCS;
    }
    else
    {
        ret_sts = HAL_IO_VDP_ERR;
    }
    return ret_sts;
}

/**
 * @brief  This function request the sleep mode
 */
hal_ret_sts io_hal_stm32f7xx_can_request_sleep(ioal_can_hdle *ioal_hcan)
{
    hal_ret_sts ret_sts = HAL_MAX_ERR;
    CAN_HandleTypeDef *hcan = ioal_hcan->intf_gen_info.vdp_intf_inst_hdle;
    if(HAL_OK == HAL_CAN_RequestSleep(hcan))
    {
        ret_sts = HAL_SCS;
    }
    else
    {
        ret_sts = HAL_IO_VDP_ERR;
    }
    return ret_sts;
}

/**
 * @brief  This function wake up from sleep mode.
 */
hal_ret_sts io_hal_stm32f7xx_can_wakeup(ioal_can_hdle *ioal_hcan)
{
    hal_ret_sts ret_sts = HAL_MAX_ERR;
    CAN_HandleTypeDef *hcan = ioal_hcan->intf_gen_info.vdp_intf_inst_hdle;
    if(HAL_OK == HAL_CAN_WakeUp(hcan))
    {
        ret_sts = HAL_SCS;
    }
    else
    {
        ret_sts = HAL_IO_VDP_ERR;
    }
    return ret_sts;
}

/**
 * @brief   This function check the sleep state of CAN interface
 */
hal_ret_sts io_hal_stm32f7xx_can_is_sleep_active(ioal_can_hdle *ioal_hcan)
{
    hal_ret_sts ret_sts = HAL_MAX_ERR;
    CAN_HandleTypeDef *hcan = ioal_hcan->intf_gen_info.vdp_intf_inst_hdle;
    if(HAL_OK == HAL_CAN_IsSleepActive(hcan))
    {
        ret_sts = HAL_SCS;
    }
    else
    {
        ret_sts = HAL_IO_VDP_ERR;
    }
    return ret_sts;
}

/**
 * @brief  This function register the CAN CallBack ID
 */
hal_ret_sts io_hal_stm32f7xx_can_reg_cb(ioal_can_hdle *ioal_hcan, iohal_stm32_can_cbid cbid)
{
    hal_ret_sts sts = HAL_SCS;
    CAN_HandleTypeDef *hcan = ioal_hcan->intf_gen_info.vdp_intf_inst_hdle;

    switch (cbid)
    {
        case IOHAL_STM32_CAN_TX_MB0_CPLT_CB_ID :
            sts = HAL_CAN_RegisterCallback(hcan, HAL_CAN_TX_MAILBOX0_COMPLETE_CB_ID,io_hal_stm32f7xx_can_tx_mb0_cplt_cb);
            break;

        case IOHAL_STM32_CAN_TX_MB1_CPLT_CB_ID :
            sts = HAL_CAN_RegisterCallback(hcan, HAL_CAN_TX_MAILBOX1_COMPLETE_CB_ID,io_hal_stm32f7xx_can_tx_mb1_cplt_cb);
            break;

        case IOHAL_STM32_CAN_TX_MB2_CPLT_CB_ID :
            sts = HAL_CAN_RegisterCallback(hcan, HAL_CAN_TX_MAILBOX2_COMPLETE_CB_ID,io_hal_stm32f7xx_can_tx_mb2_cplt_cb);
            break;

        case IOHAL_STM32_CAN_MB0_ABORT_CB_ID :
            sts = HAL_CAN_RegisterCallback(hcan, HAL_CAN_TX_MAILBOX0_ABORT_CB_ID,io_hal_stm32f7xx_can_mb0_abort_cb);
            break;

        case IOHAL_STM32_CAN_MB1_ABORT_CB_ID :
            sts = HAL_CAN_RegisterCallback(hcan, HAL_CAN_TX_MAILBOX1_ABORT_CB_ID,io_hal_stm32f7xx_can_mb1_abort_cb);
            break;

        case IOHAL_STM32_CAN_MB2_ABORT_CB_ID :
            sts = HAL_CAN_RegisterCallback(hcan, HAL_CAN_TX_MAILBOX2_ABORT_CB_ID,io_hal_stm32f7xx_can_mb2_abort_cb);
            break;

        case IOHAL_STM32_CAN_FIFO0_MSG_PEND_CB_ID :
            sts = HAL_CAN_RegisterCallback(hcan, HAL_CAN_RX_FIFO0_MSG_PENDING_CB_ID,io_hal_stm32f7xx_can_fifo0_msg_pend_cb);
            break;

        case IOHAL_STM32_CAN_FIFO0_FULL_CB_ID :
            sts = HAL_CAN_RegisterCallback(hcan, HAL_CAN_RX_FIFO0_FULL_CB_ID,io_hal_stm32f7xx_can_fifo0_full_cb);
            break;

        case IOHAL_STM32_CAN_FIFO1_MSG_PEND_CB_ID :
            sts = HAL_CAN_RegisterCallback(hcan, HAL_CAN_RX_FIFO1_MSG_PENDING_CB_ID,io_hal_stm32f7xx_can_fifo1_msg_pend_cb);
            break;

        case IOHAL_STM32_CAN_FIFO1_FULL_CB_ID :
            sts = HAL_CAN_RegisterCallback(hcan, HAL_CAN_RX_FIFO1_FULL_CB_ID,io_hal_stm32f7xx_can_fifo1_full_cb);
            break;

        case IOHAL_STM32_CAN_SLEEP_CB_ID :
            sts = HAL_CAN_RegisterCallback(hcan, HAL_CAN_SLEEP_CB_ID,io_hal_stm32f7xx_can_sleep_cb);
            break;

        case IOHAL_STM32_CAN_WAKEUP_CB_ID :
            sts = HAL_CAN_RegisterCallback(hcan, HAL_CAN_WAKEUP_FROM_RX_MSG_CB_ID,io_hal_stm32f7xx_can_wakeup_cb);
            break;

