antaris-inc/SatOS-HAL/drivers/exo_hal_driver_fw/exo_io_al_driver_api/exo_io_al_wrapper/exo_io_al_stm32f7xx/can/src/exo_io_al_stm32f7xx_can.c
        case IOHAL_STM32_CAN_ERROR_CB_ID :
            sts = HAL_CAN_RegisterCallback(hcan, HAL_CAN_ERROR_CB_ID,io_hal_stm32f7xx_can_error_cb);
            break;

        default :

            sts =  HAL_IO_INVLD_CB_FN;
            break;
    }
    return sts;
}

/**
 * @brief  Transmission Mailbox 0 complete callback function
 */
void io_hal_stm32f7xx_can_tx_mb0_cplt_cb(CAN_HandleTypeDef *hcan)
{
    ioal_can_hdle *ioal_hcan = NULL;
    if(HAL_SCS == get_ioal_inst_from_vd_inst(hcan, (void**)&ioal_hcan))
    {
        ioal_hcan->can_tx_mb0_cplt_cb(ioal_hcan);
    }
    else
    {

    }
}

/**
 * @brief  Transmission Mailbox 1 complete callback function
 */
void io_hal_stm32f7xx_can_tx_mb1_cplt_cb(CAN_HandleTypeDef *hcan)
{
    ioal_can_hdle *ioal_hcan = NULL;
    if(HAL_SCS == get_ioal_inst_from_vd_inst(hcan, (void**)&ioal_hcan))
    {
        ioal_hcan->can_tx_mb1_cplt_cb(ioal_hcan);
    }
    else
    {

    }
}

/**
 * @brief  Transmission Mailbox 2 complete callback function
 */
void io_hal_stm32f7xx_can_tx_mb2_cplt_cb(CAN_HandleTypeDef *hcan)
{
    ioal_can_hdle *ioal_hcan = NULL;
    if(HAL_SCS == get_ioal_inst_from_vd_inst(hcan, (void**)&ioal_hcan))
    {
        ioal_hcan->can_tx_mb2_cplt_cb(ioal_hcan);
    }
    else
    {

    }
}

/**
 * @brief  Transmission Mailbox 0 Cancellation callback function
 */
void io_hal_stm32f7xx_can_mb0_abort_cb(CAN_HandleTypeDef *hcan)
{
    ioal_can_hdle *ioal_hcan = NULL;
    if(HAL_SCS == get_ioal_inst_from_vd_inst(hcan, (void**)&ioal_hcan))
    {
        ioal_hcan->can_mb0_abort_cb(ioal_hcan);
    }
    else
    {

    }
}

/**
 * @brief  Transmission Mailbox 1 Cancellation callback function
 */
void io_hal_stm32f7xx_can_mb1_abort_cb(CAN_HandleTypeDef *hcan)
{
    ioal_can_hdle *ioal_hcan = NULL;
    if(HAL_SCS == get_ioal_inst_from_vd_inst(hcan, (void**)&ioal_hcan))
    {
        ioal_hcan->can_mb1_abort_cb(ioal_hcan);
    }
    else
    {

    }
}

/**
 * @brief  Transmission Mailbox 2 Cancellation callback function
 */
void io_hal_stm32f7xx_can_mb2_abort_cb(CAN_HandleTypeDef *hcan)
{
    ioal_can_hdle *ioal_hcan = NULL;
    if(HAL_SCS == get_ioal_inst_from_vd_inst(hcan, (void**)&ioal_hcan))
    {
        ioal_hcan->can_mb2_abort_cb(ioal_hcan);
    }
    else
    {

    }
}

/**
 * @brief  Rx FIFO 0 message pending callback function
 */
void io_hal_stm32f7xx_can_fifo0_msg_pend_cb(CAN_HandleTypeDef *hcan)
{
    ioal_can_hdle *ioal_hcan = NULL;
    if(HAL_SCS == get_ioal_inst_from_vd_inst(hcan, (void**)&ioal_hcan))
    {
        ioal_hcan->can_fifo0_msg_pend_cb(ioal_hcan);
    }
    else
    {

    }
}

/**
 * @brief Rx FIFO 0 full callback function
 */
void io_hal_stm32f7xx_can_fifo0_full_cb(CAN_HandleTypeDef *hcan)
{
    ioal_can_hdle *ioal_hcan = NULL;
    if(HAL_SCS == get_ioal_inst_from_vd_inst(hcan, (void**)&ioal_hcan))
    {
        ioal_hcan->can_fifo0_full_cb(ioal_hcan);
    }
    else
    {

    }
}

/**
 * @brief  Rx FIFO 1 message pending callback function
 */
void io_hal_stm32f7xx_can_fifo1_msg_pend_cb(CAN_HandleTypeDef *hcan)
{
    ioal_can_hdle *ioal_hcan = NULL;
    if(HAL_SCS == get_ioal_inst_from_vd_inst(hcan, (void**)&ioal_hcan))
    {
        ioal_hcan->can_fifo1_msg_pend_cb(ioal_hcan);
    }
    else
    {

    }
}

/**
 * @brief  Rx FIFO 1 full callback function
 */
void io_hal_stm32f7xx_can_fifo1_full_cb(CAN_HandleTypeDef *hcan)
{
    ioal_can_hdle *ioal_hcan = NULL;
    if(HAL_SCS == get_ioal_inst_from_vd_inst(hcan, (void**)&ioal_hcan))
    {
        ioal_hcan->can_fifo1_full_cb(ioal_hcan);
    }
    else
    {

    }
}

/**
 * @brief  Sleep callback function
 */
void io_hal_stm32f7xx_can_sleep_cb(CAN_HandleTypeDef *hcan)
{
    ioal_can_hdle *ioal_hcan = NULL;
    if(HAL_SCS == get_ioal_inst_from_vd_inst(hcan, (void**)&ioal_hcan))
    {
        ioal_hcan->can_sleep_cb(ioal_hcan);
    }
    else
    {

    }
}

/**
 * @brief WakeUp from Rx message callback function
 */
void io_hal_stm32f7xx_can_wakeup_cb(CAN_HandleTypeDef *hcan)
{
    ioal_can_hdle *ioal_hcan = NULL;
    if(HAL_SCS == get_ioal_inst_from_vd_inst(hcan, (void**)&ioal_hcan))
    {
        ioal_hcan->can_wakeup_cb(ioal_hcan);
    }
    else
    {

    }
}

/**
 * @brief Error CAN callback function
 */
void io_hal_stm32f7xx_can_error_cb(CAN_HandleTypeDef *hcan)
{
    ioal_can_hdle *ioal_hcan = NULL;
    if(HAL_SCS == get_ioal_inst_from_vd_inst(hcan, (void**)&ioal_hcan))
    {
        ioal_hcan->can_error_cb(ioal_hcan);
    }
    else
    {

    }
}

/**
 * @brief This function add a message to the first free Tx mailbox and activate the
 *         corresponding transmission request.
 */
hal_ret_sts io_hal_stm32f7xx_add_tx_message(ioal_can_hdle *ioal_hcan, iohal_can_tx_header *p_header, uint8_t adata[], uint32_t *ptxmailbox)
{
    hal_ret_sts ret_sts = HAL_MAX_ERR;
    CAN_HandleTypeDef *hcan = (CAN_HandleTypeDef*)ioal_hcan->intf_gen_info.vdp_intf_inst_hdle;

    CAN_TxHeaderTypeDef tx_header;
    tx_header.DLC=p_header->DLC;
    tx_header.ExtId=p_header->ExtId;
    tx_header.IDE=p_header->IDE;
    tx_header.RTR=p_header->RTR;
    tx_header.StdId=p_header->StdId;
    tx_header.TransmitGlobalTime=p_header->TransmitGlobalTime;

    if(HAL_OK ==HAL_CAN_AddTxMessage(hcan,&tx_header,adata,ptxmailbox))
    {
        ret_sts = HAL_SCS;
    }
    else
    {
        ret_sts = HAL_IO_VDP_ERR;
    }
    return ret_sts;
}

/**
 * @brief This function abort transmission requests
 */
hal_ret_sts io_hal_stm32f7xx_abort_tx_request(ioal_can_hdle *ioal_hcan, uint32_t txmailboxes)
{
    hal_ret_sts ret_sts = HAL_MAX_ERR;
    CAN_HandleTypeDef *hcan = ioal_hcan->intf_gen_info.vdp_intf_inst_hdle;
    if(HAL_OK ==HAL_CAN_AbortTxRequest(hcan,txmailboxes))
    {
        ret_sts = HAL_SCS;
    }
    else
    {
        ret_sts = HAL_IO_VDP_ERR;
    }
    return ret_sts;
}

/**
 * @brief  This function returns the number of free Tx Mailboxes.
 */
uint32_t io_hal_stm32f7xx_get_tx_mailboxes_free_level(ioal_can_hdle *ioal_hcan)
{
    uint32_t free_lvl;
    CAN_HandleTypeDef *hcan = ioal_hcan->intf_gen_info.vdp_intf_inst_hdle;
    free_lvl = HAL_CAN_GetTxMailboxesFreeLevel(hcan);
    return free_lvl;
}

/**
 * @brief  This function check if a transmission request is pending on Tx side
 */
uint32_t io_hal_stm32f7xx_is_tx_message_pending(ioal_can_hdle *ioal_hcan, uint32_t txmailboxes)
{
    uint32_t ret_sts;
    CAN_HandleTypeDef *hcan = ioal_hcan->intf_gen_info.vdp_intf_inst_hdle;
    ret_sts=HAL_CAN_IsTxMessagePending(hcan,txmailboxes);
    return ret_sts;
}

/**
 * @brief This function get timestamp of Tx message sent
 */
uint32_t io_hal_stm32f7xx_get_tx_time_stamp(ioal_can_hdle *ioal_hcan, uint32_t txmailbox)
{
    uint32_t ret_sts;
    CAN_HandleTypeDef *hcan = ioal_hcan->intf_gen_info.vdp_intf_inst_hdle;
    ret_sts=HAL_CAN_GetTxTimestamp(hcan,txmailbox);
    return ret_sts;
}

/**
 * @brief This function gets CAN frame from the Rx FIFO
 */
hal_ret_sts io_hal_stm32f7xx_get_rx_message(ioal_can_hdle *ioal_hcan, uint32_t rxfifo, iohal_can_rx_header *p_header, uint8_t adata[])
{
    hal_ret_sts ret_sts = HAL_MAX_ERR;
    CAN_HandleTypeDef *hcan = ioal_hcan->intf_gen_info.vdp_intf_inst_hdle;
    CAN_RxHeaderTypeDef rx_header;
    if(HAL_OK == HAL_CAN_GetRxMessage(hcan,rxfifo,&rx_header,adata))
    {
        p_header->DLC=rx_header.DLC;
        p_header->ExtId=rx_header.ExtId;
        p_header->IDE=rx_header.IDE;
        p_header->RTR=rx_header.RTR;
        p_header->StdId=rx_header.StdId;
        p_header->Timestamp=rx_header.Timestamp;
        p_header->FilterMatchIndex=rx_header.FilterMatchIndex;
        ret_sts = HAL_SCS;
    }
    else
    {
        ret_sts = HAL_IO_VDP_ERR;
    }
    return ret_sts;
}

/**
 * @brief This function get Rx FIFO fill level.
 */
uint32_t io_hal_stm32f7xx_get_rx_fifo_fill_level(ioal_can_hdle *ioal_hcan, uint32_t rxfifo)
{
    uint32_t ret_sts;
    CAN_HandleTypeDef *hcan = ioal_hcan->intf_gen_info.vdp_intf_inst_hdle;
    ret_sts=HAL_CAN_GetRxFifoFillLevel(hcan,rxfifo);
    return ret_sts;
}

/**
 * @brief  This function configures the CAN reception filter
 */
hal_ret_sts io_hal_stm32f7xx_can_configfilter(ioal_can_hdle *ioal_hcan, iohal_can_filter *sFilterConfig)
{
    hal_ret_sts ret_sts = HAL_MAX_ERR;
    CAN_HandleTypeDef *hcan = ioal_hcan->intf_gen_info.vdp_intf_inst_hdle;

    if(HAL_OK == HAL_CAN_ConfigFilter(hcan,(void*)sFilterConfig))
    {
        ret_sts = HAL_SCS;
    }
    else
    {
        ret_sts = HAL_IO_VDP_ERR;
    }
    return ret_sts;
}

