antaris-inc/SatOS-HAL/drivers/exo_hal_driver_fw/exo_io_al_driver_api/exo_io_al_wrapper/exo_io_al_stm32f7xx/can/src/exo_io_al_stm32f7xx_can.c
/* Interrupts management ******************************************************/
/**
 * @brief This function activate notifications
 */
hal_ret_sts io_hal_stm32f7xx_can_activate_notification(ioal_can_hdle *ioal_hcan, uint32_t active_its)
{
    hal_ret_sts ret_sts = HAL_MAX_ERR;
    CAN_HandleTypeDef *hcan = ioal_hcan->intf_gen_info.vdp_intf_inst_hdle;
    if(HAL_OK == HAL_CAN_ActivateNotification(hcan,active_its))
    {
        ret_sts = HAL_SCS;
    }
    else
    {
        ret_sts = HAL_IO_VDP_ERR;
    }
    return ret_sts;
}

/**
 * @brief   This function deactivate notifications
 */
hal_ret_sts io_hal_stm32f7xx_can_deactivate_notification(ioal_can_hdle *ioal_hcan, uint32_t inactive_its)
{
    hal_ret_sts ret_sts = HAL_MAX_ERR;
    CAN_HandleTypeDef *hcan = ioal_hcan->intf_gen_info.vdp_intf_inst_hdle;
    if(HAL_OK ==HAL_CAN_DeactivateNotification(hcan,inactive_its))
    {
        ret_sts = HAL_SCS;
    }
    else
    {
        ret_sts = HAL_IO_VDP_ERR;
    }
    return ret_sts;
}

/* Peripheral State and Error functions ***************************************/
/**
 *@brief  This function get the CAN state.
 */
iohal_can_state io_hal_stm32f7xx_can_get_state(ioal_can_hdle *ioal_hcan)
{

    CAN_HandleTypeDef *hcan = ioal_hcan->intf_gen_info.vdp_intf_inst_hdle;
    return ((iohal_can_state)HAL_CAN_GetState(hcan));
}

/**
 *@brief  This function get the CAN error code.
 */
hal_ret_sts io_hal_stm32f7xx_can_get_error(ioal_can_hdle *ioal_hcan)
{
    hal_ret_sts ret_sts = HAL_MAX_ERR;
    CAN_HandleTypeDef *hcan = ioal_hcan->intf_gen_info.vdp_intf_inst_hdle;
    if(HAL_OK == HAL_CAN_GetError(hcan))
    {
        ret_sts = HAL_SCS;
    }
    else
    {
        ret_sts = HAL_IO_VDP_ERR;
    }
    return ret_sts;
}

/**
 *@brief  This function reset the CAN error code.
 */
hal_ret_sts io_hal_stm32f7xx_can_reset_error(ioal_can_hdle *ioal_hcan)
{
    hal_ret_sts ret_sts = HAL_MAX_ERR;
    CAN_HandleTypeDef *hcan = ioal_hcan->intf_gen_info.vdp_intf_inst_hdle;
    if(HAL_OK ==  HAL_CAN_ResetError(hcan))
    {
        ret_sts = HAL_SCS;
    }
    else
    {
        ret_sts = HAL_IO_VDP_ERR;
    }
    return ret_sts;
}
